load-tests/scenario5-medium-soak.yml
config:
  target: "http://a724c736bdfbf4e42875d8f1e19c5069-710728609.us-east-1.elb.amazonaws.com"
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "{{ $env.PUSHGATEWAY_URL }}"
        tags:
          - "run_id:{{ $env.RUN_ID }}"
          - "scenario:medium-soak"
          - "env:aws-eks"
          - "git_sha:{{ $env.GIT_SHA }}"
  phases:
    - duration: 300
      arrivalRate: 14
      name: "Medium soak - 14 requests/second for 5 minutes"
scenarios:
  - name: "Book a ticket"
    flow:
      - put:
          url: "/ticket"