load-tests/scenario7-burst-load.yml
config:
  target: "http://a724c736bdfbf4e42875d8f1e19c5069-710728609.us-east-1.elb.amazonaws.com"
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "{{ $env.PUSHGATEWAY_URL }}"
        tags:
          - "run_id:{{ $env.RUN_ID }}"
          - "scenario:burst-load"
          - "env:aws-eks"
          - "git_sha:{{ $env.GIT_SHA }}"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Burst baseline - 10 requests/second"
    - duration: 30
      arrivalRate: 30
      name: "Burst spike - 30 requests/second"
    - duration: 60
      arrivalRate: 10
      name: "Burst recovery - 10 requests/second"
scenarios:
  - name: "Book a ticket"
    flow:
      - put:
          url: "/ticket"